export type TLanguage = keyof typeof BUTTON_TEXT;

const BUTTON_TEXT = {
  ARM: 'Սեղմի ինձ!',
  RUS: 'Нажми на меня!',
} as const;

const FOOTER_BUTTON_TEXT = {
  ARM: 'Եվ վերջում!',
  RUS: 'И на последок!',
};

const SWITCH_LABELS = {
  ARM: 'ՀԱՅ',
  RUS: 'РУС',
} as const;

const MAIN_TEXT = {
  ARM: 'Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! ',
  RUS: 'Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! ',
} as const;

const FOOTER_TEXT = {
  RUS: 'Кого еще благодарить, кроме как Бога!\n(но вообще можно еще поблагодарить Нелли и Наиру, конечно же)',
  ARM: 'Ում էլ շնորհակալ լինել, եթե ոչ Աստծուն!\n(բայց, իհարկե, կարելի է շնորհակալություն հայտնել նաև Նելլիին և Նայրային)',
} as const;

const FOOTER_SECOND_TEXT = {
  RUS: 'Крепко крепко тебя обнимаю, держу за ручку и не отпускаю! Не забывай, что рядом. Я очень рад, что ты появилась в моей жизни и мы теперь можем делиться друг с другом своим миром.\nТы чудо ♥️♥️♥️',
  ARM: 'Ուժեղ-ուժեղ քեզ գրկում եմ, ձեռքըդ բռնում ու չեմ թողնում! Մի մոռացի, որ կողքիդ եմ! Շատ ուրախ եմ, որ դու հայտնվեցիր իմ կյանքում, և հիմա մենք կարող ենք կիսվել միմյանց մեր աշխարհներով!\nԴու հրաշք ես ♥️♥️♥️',
} as const;

const FOOTER_LAST_TEXT = {
  RUS: 'Всегда твой, Размик 🫶🏼🫶🏼🫶🏼✨✨\n(но для тебя еще Винни, конечно же)\n(и Салливан тоже...)',
  ARM: 'Միշտ քեզնից հետո, Ռազմիկ 🫶🏼🫶🏼🫶🏼✨✨\n(բայց քեզ համար նաև Վիննի, իհարկե)\n (ու Սալիվանը էլ...)',
};

export {
  BUTTON_TEXT,
  SWITCH_LABELS,
  MAIN_TEXT,
  FOOTER_BUTTON_TEXT,
  FOOTER_TEXT,
  FOOTER_SECOND_TEXT,
  FOOTER_LAST_TEXT,
};
