export type TLanguage = keyof typeof BUTTON_TEXT;

const BUTTON_TEXT = {
  ARM: 'Սեղմի ինձ!',
  RUS: 'Нажми на меня!',
} as const;

const FOOTER_BUTTON_TEXT = {
  ARM: 'Եվ վերջում!',
  RUS: 'И на последок!',
};

const SWITCH_LABELS = {
  ARM: 'ՀԱՅ',
  RUS: 'РУС',
} as const;

const MAIN_TEXT = {
  ARM: 'Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! Բարև աշխարհ! ',
  RUS: 'Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! Привет мир! ',
} as const;

const FOOTER_TEXT = {
  RUS: 'Кого еще благодарить, кроме как Бога!\n(но вообще можно еще поблагодарить Нелли и Наиру, конечно же)',
  ARM: 'Ում էլ շնորհակալ լինել, եթե ոչ Աստծուն։\n(բայց, իհարկե, կարելի է շնորհակալություն հայտնել նաև Նելլիին և Նայրային)',
} as const;

export { BUTTON_TEXT, SWITCH_LABELS, MAIN_TEXT, FOOTER_BUTTON_TEXT, FOOTER_TEXT };
